config/ext/DataProcessors/РС_ИзменениеДопСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>РС_ИзменениеДопСведений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

config/ext/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/ext/DataProcessors/РС_ИзменениеДопСведений/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСписокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство ИЛИ &Свойство = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("Свойство", ?(ЗначениеЗаполнено(Свойство), Свойство, Неопределено));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДополнительныеСведения.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокНаСервере()
КонецПроцедуры

&НаСервере
Процедура ДополнительныеСведенияПриИзмененииНаСервере()
	
	ТекущаяСтрока = ДополнительныеСведения.НайтиПоИдентификатору(Элементы.ДополнительныеСведения.ТекущаяСтрока);
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Объект) 
		ИЛИ Не ЗначениеЗаполнено(ТекущаяСтрока.Свойство)
		ИЛИ Не ЗначениеЗаполнено(ТекущаяСтрока.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МЗ.Объект = ТекущаяСтрока.Объект;
	МЗ.Свойство = ТекущаяСтрока.Свойство;
	МЗ.Значение = ТекущаяСтрока.Значение;
	МЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСведенияПриИзменении(Элемент)
	ДополнительныеСведенияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнительныеСведенияПередУдалениемНаСервере(СтруктураСтроки)
	
	МЗ = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МЗ.Объект = СтруктураСтроки.Объект;
	МЗ.Свойство = СтруктураСтроки.Свойство;
	МЗ.Значение = СтруктураСтроки.Значение;
	МЗ.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСведенияПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = ДополнительныеСведения.НайтиПоИдентификатору(Элементы.ДополнительныеСведения.ТекущаяСтрока);
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Объект",ТекущаяСтрока.Объект);
	СтруктураСтроки.Вставить("Свойство",ТекущаяСтрока.Свойство);
	СтруктураСтроки.Вставить("Значение",ТекущаяСтрока.Значение);
	
	ДополнительныеСведенияПередУдалениемНаСервере(СтруктураСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СвойствоПриИзменении(Элемент)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеСведенияСвойствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	
	
КонецПроцедуры
